references/prototype-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-05 ven. 17:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="teddd" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd3179f5">1. Prototype 1</a>
<ul>
<li><a href="#org3e65e3a">1.1. Tool to look for jobs</a>
<ul>
<li><a href="#org29c3b90">1.1.1. static backend</a></li>
<li><a href="#org77c3e3e">1.1.2. front end</a></li>
</ul>
</li>
<li><a href="#org3dcb9ca">1.2. potfolio</a>
<ul>
<li><a href="#org6f0f88d">1.2.1. blog : Gandi / git</a></li>
<li><a href="#org76664bd">1.2.2. Portability</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd3179f5" class="outline-2">
<h2 id="orgd3179f5"><span class="section-number-2">1</span> Prototype 1</h2>
<div class="outline-text-2" id="text-1">
<p>
For this first version of the program that should be ready for use in a portfolio, objectives are to select jobs depending on word apparitions, browse offers, and have some basic stats of word usage.
</p>
</div>
<div id="outline-container-org3e65e3a" class="outline-3">
<h3 id="org3e65e3a"><span class="section-number-3">1.1</span> Tool to look for jobs</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org29c3b90" class="outline-4">
<h4 id="org29c3b90"><span class="section-number-4">1.1.1</span> static backend</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgff93efc"></a>scrapping<br />
<ol class="org-ol">
<li><a id="org97c49d8"></a><span class="done DONE">DONE</span> check result of today 2018-09-14 ven. 20:20<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
</div>
</li>
<li><a id="orgaa18361"></a><span class="todo TODO">TODO</span> launch everyday from query list<br />
<ol class="org-ol">
<li><a id="org279553e"></a><span class="done DONE">DONE</span> make query list out of already made queries<br />
<div class="outline-text-7" id="text-1-1-1-1-2-1">
</div>
</li>
<li><a id="org1937375"></a>cron<br /></li>
</ol>
</li>
<li><a id="org7886619"></a>add source query to features<br /></li>
<li><a id="orgfe725cd"></a>spped up<br />
<ol class="org-ol">
<li><a id="org8e9419d"></a>remove self set limits ?<br /></li>
<li><a id="org74186fa"></a>server bans ?<br /></li>
<li><a id="org36485a9"></a>vpn ?<br /></li>
<li><a id="org27b1483"></a>tor ?<br /></li>
</ol>
</li>
<li><a id="org59f544d"></a>test : make scrap of the whole website<br /></li>
</ol>
</li>
<li><a id="org137c68c"></a>data selection<br />
<ol class="org-ol">
<li><a id="orgbac37b5"></a>org : form interface<br /></li>
<li><a id="org6099d39"></a><span class="done DONE">DONE</span> add tags to actual dataset / save working dataset<br />
<div class="outline-text-6" id="text-1-1-1-2-2">
</div>
</li>
</ol>
</li>
<li><a id="org95e6e72"></a>filtering<br />
<div class="outline-text-5" id="text-1-1-1-3">
</div>
<ol class="org-ol">
<li><a id="org4aca843"></a><span class="done DONE">DONE</span> resolve ipython output<br />
<div class="outline-text-6" id="text-1-1-1-3-1">
</div>
</li>
</ol>
</li>
<li><a id="orgd1c79c4"></a>internal correlations<br />
<ol class="org-ol">
<li><a id="orga2b4c5e"></a>nlp<br />
<ol class="org-ol">
<li><a id="org28075d7"></a>nltk<br /></li>
<li><a id="org56ed02d"></a>similarity / clustering<br /></li>
<li><a id="org35181d2"></a>speed !<br />
<ol class="org-ol">
<li><a id="orgaff5c28"></a>numpy<br /></li>
<li><a id="org52f1941"></a>sql<br /></li>
<li><a id="orgedf774a"></a>cython<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="org6344b75"></a>historic<br />
<ol class="org-ol">
<li><a id="org64d7822"></a>redondancy / new<br /></li>
<li><a id="orgc0b461c"></a>database sorted per date<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="orgbe3fb9d"></a>external correlations<br />
<ol class="org-ol">
<li><a id="org57db4a2"></a>identify big firms / small ventures<br /></li>
<li><a id="org40a4765"></a>geolocalize headquarters on a map<br /></li>
</ol>
</li>
<li><a id="orge6d8eee"></a>querying system<br /></li>
</ol>
</div>
<div id="outline-container-org77c3e3e" class="outline-4">
<h4 id="org77c3e3e"><span class="section-number-4">1.1.2</span> front end</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="orgd953e48"></a><span class="todo TODO">TODO</span> queries management<br />
<ol class="org-ol">
<li><a id="org37043f5"></a><span class="done DONE">DONE</span> query bag<br />
<div class="outline-text-6" id="text-1-1-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orgb756e43"></a>simple plain text file<br /></li>
<li><a id="org08ce620"></a>prompt : "add to query bag ?" when running a crawl<br /></li>
<li><a id="orgf772690"></a>autofill : get all previously used queries<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="orgeb34edb"></a>fiche job<br /></li>
<li><a id="orgd63d4d3"></a>analysis viz<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org3dcb9ca" class="outline-3">
<h3 id="org3dcb9ca"><span class="section-number-3">1.2</span> potfolio</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org6f0f88d" class="outline-4">
<h4 id="org6f0f88d"><span class="section-number-4">1.2.1</span> blog : Gandi / git</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="orgae12614"></a>article présentation<br /></li>
<li><a id="org1b16c74"></a>extensions futur<br /></li>
</ol>
</div>
<div id="outline-container-org76664bd" class="outline-4">
<h4 id="org76664bd"><span class="section-number-4">1.2.2</span> Portability</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org78d9dfc"></a>docker / makefile package<br /></li>
<li><a id="orgd67ca91"></a>Test with a friend<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: teddd</p>
<p class="date">Created: 2018-10-05 ven. 17:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
